socialNetwork/jaeger_traces/limit_socnetapp_home-timeline-service/traces_0.8.log
Running 30s test @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 4.923ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.037ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.802ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.980ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.815ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.405ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.774ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.884ms, rate sampling interval: 11ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.59ms  707.46us   6.60ms   74.56%
    Req/Sec    25.51     48.80   200.00     75.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.49ms
 75.000%    4.95ms
 90.000%    5.45ms
 99.000%    6.60ms
 99.900%    9.73ms
 99.990%   14.20ms
 99.999%   14.20ms
100.000%   14.20ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.159     0.000000            1         1.00
       3.835     0.100000          391         1.11
       4.027     0.200000          780         1.25
       4.179     0.300000         1181         1.43
       4.331     0.400000         1568         1.67
       4.491     0.500000         1955         2.00
       4.567     0.550000         2145         2.22
       4.655     0.600000         2344         2.50
       4.755     0.650000         2538         2.86
       4.851     0.700000         2733         3.33
       4.955     0.750000         2930         4.00
       5.015     0.775000         3023         4.44
       5.079     0.800000         3123         5.00
       5.151     0.825000         3218         5.71
       5.231     0.850000         3319         6.67
       5.323     0.875000         3412         8.00
       5.387     0.887500         3465         8.89
       5.447     0.900000         3512        10.00
       5.515     0.912500         3560        11.43
       5.607     0.925000         3608        13.33
       5.707     0.937500         3657        16.00
       5.759     0.943750         3683        17.78
       5.807     0.950000         3705        20.00
       5.875     0.956250         3730        22.86
       5.927     0.962500         3753        26.67
       6.031     0.968750         3778        32.00
       6.071     0.971875         3791        35.56
       6.127     0.975000         3804        40.00
       6.151     0.978125         3815        45.71
       6.231     0.981250         3826        53.33
       6.303     0.984375         3839        64.00
       6.351     0.985938         3845        71.11
       6.431     0.987500         3852        80.00
       6.523     0.989062         3857        91.43
       6.659     0.990625         3863       106.67
       6.703     0.992188         3869       128.00
       6.871     0.992969         3872       142.22
       6.943     0.993750         3875       160.00
       7.003     0.994531         3878       182.86
       7.163     0.995313         3881       213.33
       7.387     0.996094         3884       256.00
       7.811     0.996484         3886       284.44
       7.859     0.996875         3887       320.00
       8.311     0.997266         3889       365.71
       8.375     0.997656         3890       426.67
       9.375     0.998047         3892       512.00
       9.503     0.998242         3893       568.89
       9.503     0.998437         3893       640.00
       9.687     0.998633         3894       731.43
       9.727     0.998828         3895       853.33
       9.783     0.999023         3896      1024.00
       9.783     0.999121         3896      1137.78
       9.783     0.999219         3896      1280.00
      10.071     0.999316         3897      1462.86
      10.071     0.999414         3897      1706.67
      11.343     0.999512         3898      2048.00
      11.343     0.999561         3898      2275.56
      11.343     0.999609         3898      2560.00
      11.343     0.999658         3898      2925.71
      11.343     0.999707         3898      3413.33
      14.199     0.999756         3899      4096.00
      14.199     1.000000         3899          inf
#[Mean    =        4.592, StdDeviation   =        0.707]
#[Max     =       14.192, Total count    =         3899]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5805 requests in 30.04s, 1.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 9511
Requests/sec:    193.26  
Transfer/sec:     40.58KB